### inthis notebook we cover datatype broadcasting technique
##           don,t disturb thid file

In [1]:
import pandas as pd
import numpy as np

In [48]:
data={"string_col":['1','2','3','4','5'],
     "int_float":[1,3,2,2.2,3],
     "int_col":[4,4,64,43,34],
     "mising_col":[1,3,4,5,np.nan],
     "mixed_col":["a","-2",3,4,3],
     "price":["$1,500.00","$2,436.45","$9,58.99","$1,798.00","$5,456.25"]}

In [3]:
type(data)

dict

In [49]:
data=pd.DataFrame(data=data)
data

  string_col  int_float  int_col  mising_col mixed_col      price
0          1        1.0        4         1.0         a  $1,500.00
1          2        3.0        4         3.0        -2  $2,436.45
2          3        2.0       64         4.0         3   $9,58.99
3          4        2.2       43         5.0         4  $1,798.00
4          5        3.0       34         NaN         3  $5,456.25

In [5]:
data.dtypes

string_col     object
int_float     float64
int_col         int64
mising_col    float64
mixed_col      object
price          object
dtype: object

In [6]:
data['string_col']=data['string_col'].astype(int)
data['string_col'].dtypes

dtype('int32')

In [7]:
data.head(3)

   string_col  int_float  int_col  mising_col mixed_col      price
0           1        1.0        4         1.0         a  $1,500.00
1           2        3.0        4         3.0        -2  $2,436.45
2           3        2.0       64         4.0         3    $958.99

In [8]:
data['string_col']=data['string_col'].astype(float)
data['string_col'].dtypes

dtype('float64')

In [9]:
data["string_col"]

0    1.0
1    2.0
2    3.0
3    4.0
4    5.0
Name: string_col, dtype: float64

### and now i will deal with the int_float column

In [10]:
data['int_float'].dtypes

dtype('float64')

In [11]:
data['int_float']=data['int_float'].astype(int)
data['int_float'].dtypes

dtype('int32')

In [12]:
data.head()

   string_col  int_float  int_col  mising_col mixed_col      price
0         1.0          1        4         1.0         a  $1,500.00
1         2.0          3        4         3.0        -2  $2,436.45
2         3.0          2       64         4.0         3    $958.99
3         4.0          2       43         5.0         4  $1,798.00
4         5.0          3       34         NaN         3  $5,456.25

In [13]:
data.dtypes

string_col    float64
int_float       int32
int_col         int64
mising_col    float64
mixed_col      object
price          object
dtype: object

In [14]:
data['int_float']=data['int_float'].astype(float)
data['int_float'].dtypes

dtype('float64')

In [15]:
data.head()

   string_col  int_float  int_col  mising_col mixed_col      price
0         1.0        1.0        4         1.0         a  $1,500.00
1         2.0        3.0        4         3.0        -2  $2,436.45
2         3.0        2.0       64         4.0         3    $958.99
3         4.0        2.0       43         5.0         4  $1,798.00
4         5.0        3.0       34         NaN         3  $5,456.25

### and i will deal with the int_col to string column

In [16]:
data['int_col']=data['int_col'].astype(str)
data['int_col'][2]

'64'

In [17]:
data['int_col']=data['int_col'].astype(int)
data['int_col'][2]

64

### now , i will deal with the missing column
#### here rember that , a mising value dos,nt convert into the integer value
#### but if you want to convert than u can convert your mising value atribute to the float
#### if you need convert your mising value column in int than fill null value

In [18]:
data['mising_col']

0    1.0
1    3.0
2    4.0
3    5.0
4    NaN
Name: mising_col, dtype: float64

In [19]:
data['mising_col']=data['mising_col'].astype(float)
data['mising_col'].dtypes

dtype('float64')

In [20]:
data['mising_col']=data['mising_col'].astype(int)  #it is not possible bcz here mising value
data['mising_col'].dtypes

ValueError: Cannot convert non-finite values (NA or inf) to integer

In [22]:
data

   string_col  int_float  int_col  mising_col mixed_col      price
0         1.0        1.0        4         1.0         a  $1,500.00
1         2.0        3.0        4         3.0        -2  $2,436.45
2         3.0        2.0       64         4.0         3    $958.99
3         4.0        2.0       43         5.0         4  $1,798.00
4         5.0        3.0       34         NaN         3  $5,456.25

In [23]:
data['mising_col']=pd.to_numeric(data.mising_col)
data.mising_col

#here result will be prsent in the float64 and nun value present alse here
# if you want to change into int then remeber some point to keep in mind
# first "Int64" in string will have to parse and after the to_numeric
# bcz only one thid data typ can change the mising value present in float datatype

0    1.0
1    3.0
2    4.0
3    5.0
4    NaN
Name: mising_col, dtype: float64

In [24]:
data['mising_col']=pd.to_numeric(data.mising_col).astype('Int64')    #this syntex is important for convert to mising value into Int64
data.mising_col

0       1
1       3
2       4
3       5
4    <NA>
Name: mising_col, dtype: Int64

### and we will remove the null value in the mising_col after that we will change the dattype in integer

In [25]:
data

   string_col  int_float  int_col  mising_col mixed_col      price
0         1.0        1.0        4           1         a  $1,500.00
1         2.0        3.0        4           3        -2  $2,436.45
2         3.0        2.0       64           4         3    $958.99
3         4.0        2.0       43           5         4  $1,798.00
4         5.0        3.0       34        <NA>         3  $5,456.25

In [26]:
data['mising_col']=data['mising_col'].fillna(0)

In [27]:
data

   string_col  int_float  int_col  mising_col mixed_col      price
0         1.0        1.0        4           1         a  $1,500.00
1         2.0        3.0        4           3        -2  $2,436.45
2         3.0        2.0       64           4         3    $958.99
3         4.0        2.0       43           5         4  $1,798.00
4         5.0        3.0       34           0         3  $5,456.25

In [28]:
data.mising_col.dtypes

Int64Dtype()

### let,s go to the mixed_col for deal the that datatype

In [29]:
data.mixed_col.dtypes

dtype('O')

In [30]:
data['mixed_col'].map(str)[3]          #and now this is string datatype

'4'

In [31]:
dist={'a':'5'}        # this is not working but its all right my friend i have another idea
# just i have return a null vlue ,and we can deal with the null value

In [32]:
def chechfunc(x):
    if x=="a":
        dist[x]
    else:
        return x

In [33]:
data['mixed_col'].map(chechfunc)

0    None
1      -2
2       3
3       4
4       3
Name: mixed_col, dtype: object

In [34]:
data.mixed_col.dtypes
#and this is float64 and we want into int

dtype('O')

In [35]:
data['mixed_col']=pd.to_numeric(data.mixed_col,errors="coerce").fillna(0).astype(int)
data

   string_col  int_float  int_col  mising_col  mixed_col      price
0         1.0        1.0        4           1          0  $1,500.00
1         2.0        3.0        4           3         -2  $2,436.45
2         3.0        2.0       64           4          3    $958.99
3         4.0        2.0       43           5          4  $1,798.00
4         5.0        3.0       34           0          3  $5,456.25

In [36]:
data

   string_col  int_float  int_col  mising_col  mixed_col      price
0         1.0        1.0        4           1          0  $1,500.00
1         2.0        3.0        4           3         -2  $2,436.45
2         3.0        2.0       64           4          3    $958.99
3         4.0        2.0       43           5          4  $1,798.00
4         5.0        3.0       34           0          3  $5,456.25

### and it is my last column that are price this
## atribute is "o" typ and we want to change dtype as well as
## formating this string

In [37]:
data['price']=data['price'].str.replace("$",'')
data['price'].dtypes

<ipython-input-37-2998f52a6976>:1: FutureWarning: The default value of regex will change from True to False in a future version. In addition, single character regular expressions will*not* be treated as literal strings when regex=True.
  data['price']=data['price'].str.replace("$",'')

dtype('O')

In [45]:
data

   string_col  int_float  int_col  mising_col  mixed_col     price
0         1.0        1.0        4           1          0  1,500.00
1         2.0        3.0        4           3         -2  2,436.45
2         3.0        2.0       64           4          3    958.99
3         4.0        2.0       43           5          4  1,798.00
4         5.0        3.0       34           0          3  5,456.25

In [54]:
data['price']=data['price'].str.replace('$','').str.replace(',','')
data['price']

<ipython-input-54-036f1c94f32a>:1: FutureWarning: The default value of regex will change from True to False in a future version. In addition, single character regular expressions will*not* be treated as literal strings when regex=True.
  data['price']=data['price'].str.replace('$','').str.replace(',','')

dtype('O')

In [60]:
data['price']=pd.to_numeric(data['price']).astype(int)
data['price'].dtypes

dtype('int32')

## finally, i has comlete everything and some another point

In [2]:
drink=pd.read_csv('http://bit.ly/drinksbycountry')

In [4]:
drink.dtypes

country                          object
beer_servings                     int64
spirit_servings                   int64
wine_servings                     int64
total_litres_of_pure_alcohol    float64
continent                        object
dtype: object

In [6]:
drink.beer_servings.astype(float)
#by this method does not effect in the main dataset

0        0.0
1       89.0
2       25.0
3      245.0
4      217.0
       ...
188    333.0
189    111.0
190      6.0
191     32.0
192     64.0
Name: beer_servings, Length: 193, dtype: float64

In [8]:
drink.dtypes

country                          object
beer_servings                     int64
spirit_servings                   int64
wine_servings                     int64
total_litres_of_pure_alcohol    float64
continent                        object
dtype: object

In [9]:
drink.beer_servings=drink.beer_servings.astype(float)

In [10]:
drink.dtypes

country                          object
beer_servings                   float64
spirit_servings                   int64
wine_servings                     int64
total_litres_of_pure_alcohol    float64
continent                        object
dtype: object

In [18]:
drink=pd.read_csv('http://bit.ly/drinksbycountry',dtype={'beer_servings':int})
drink.dtypes
#you can use dtype in the import time and parse_dates,and date_parser,

country                          object
beer_servings                     int32
spirit_servings                   int64
wine_servings                     int64
total_litres_of_pure_alcohol    float64
continent                        object
dtype: object

# here some project concept on this  dataset

In [171]:
type(drink.columns.values)
#values function is used to convert a listed value in a array

numpy.ndarray

In [42]:
drink.continent.value_counts()
# this function return pands core series 
#

Africa           53
Europe           45
Asia             44
North America    23
Oceania          16
South America    12
Name: continent, dtype: int64

In [55]:
drink.to_csv('drink_file.csv')

In [52]:
orders=pd.read_table('http://bit.ly/chiporders')

In [57]:
orders.to_csv('chiporders_list')

In [58]:
orders.head()

,order_id,quantity,item_name,choice_description,item_price
0,1,1,Chips and Fresh Tomato Salsa,NaN,$2.39
1,1,1,Izze,[Clementine],$3.39
2,1,1,Nantucket Nectar,[Apple],$3.39
3,1,1,Chips and Tomatillo-Green Chili Salsa,NaN,$2.39
4,2,2,Chicken Bowl,"[Tomatillo-Red Chili Salsa (Hot), [Black Beans...",$16.98

In [59]:
orders.item_price.str.replace("$","")

<ipython-input-59-f810acf27616>:1: FutureWarning: The default value of regex will change from True to False in a future version. In addition, single character regular expressions will*not* be treated as literal strings when regex=True.
  orders.item_price.str.replace("$","")

0        2.39
1        3.39
2        3.39
3        2.39
4       16.98
         ...
4617    11.75
4618    11.75
4619    11.25
4620     8.75
4621     8.75
Name: item_price, Length: 4622, dtype: object

In [76]:
orders.item_price.str.replace("$","").mean()
#here error occuring because it is not numerical returun

<ipython-input-76-1275e1c26a2e>:1: FutureWarning: The default value of regex will change from True to False in a future version. In addition, single character regular expressions will*not* be treated as literal strings when regex=True.
  orders.item_price.str.replace("$","")

0        2.39
1        3.39
2        3.39
3        2.39
4       16.98
         ...
4617    11.75
4618    11.75
4619    11.25
4620     8.75
4621     8.75
Name: item_price, Length: 4622, dtype: object

In [84]:
orders.item_price=orders.item_price.str.replace("$","").astype(float)
orders.item_price
#and now this is float so mean is displaying

<ipython-input-84-ada7ddd0b779>:1: FutureWarning: The default value of regex will change from True to False in a future version. In addition, single character regular expressions will*not* be treated as literal strings when regex=True.
  orders.item_price=orders.item_price.str.replace("$","").astype(float)

0        2.39
1        3.39
2        3.39
3        2.39
4       16.98
        ...
4617    11.75
4618    11.75
4619    11.25
4620     8.75
4621     8.75
Name: item_price, Length: 4622, dtype: float64

In [78]:
orders[orders.item_name.str.contains('Chicken')].shape

(1560, 5)

In [86]:
chicken_item=orders[orders.item_name.str.contains('Chicken')].head(3)

In [116]:
(orders['item_price'] >20).value_counts()

False    4575
True       47
Name: item_price, dtype: int64

### i want fatche those items are price less than 20 rupees

In [129]:
record_47=orders[orders['item_price'] >20].sort_values(by='item_price',ascending=False)
leng=record_47[['item_name','item_price']].index
len(leng)
fatch_data_less_than_20=record_47[['item_name','item_price']]
fatch_data_less_than_20.shape

(47, 2)

In [166]:
fatch_data_less_than_20.reset_index(drop=True)

                       item_name  item_price
0   Chips and Fresh Tomato Salsa       44.25
1                  Carnitas Bowl       35.25
2                Chicken Burrito       35.00
3                Chicken Burrito       35.00
4                 Veggie Burrito       33.75
5                   Chicken Bowl       32.94
6                  Steak Burrito       27.75
7                  Steak Burrito       27.75
8                Chicken Burrito       26.25
9                Chicken Burrito       26.25
10                  Chicken Bowl       26.25
11                    Steak Bowl       26.07
12              Steak Salad Bowl       23.78
13              Steak Salad Bowl       23.78
14                 Steak Burrito       23.50
15                    Steak Bowl       23.50
16                    Steak Bowl       23.50
17                    Steak Bowl       23.50
18                 Carnitas Bowl       23.50
19                    Steak Bowl       23.50
20                 Steak Burrito       22.96
21                  Chicken Bowl       22.50
22            Chicken Salad Bowl       22.50
23                  Chicken Bowl       22.50
24            Chicken Salad Bowl       22.50
25            Chicken Salad Bowl       22.50
26                  Chicken Bowl       22.50
27            Chicken Salad Bowl       22.50
28            Chicken Salad Bowl       22.50
29            Chicken Salad Bowl       22.50
30            Chicken Salad Bowl       22.50
31            Chicken Salad Bowl       22.50
32            Chicken Salad Bowl       22.50
33            Chicken Salad Bowl       22.50
34                          Bowl       22.20
35                 Steak Burrito       22.16
36                 Steak Burrito       22.16
37                  Chicken Bowl       21.96
38               Chicken Burrito       21.96
39                  Chicken Bowl       21.96
40                  Chicken Bowl       21.96
41               Chicken Burrito       21.96
42                  Chicken Bowl       21.96
43                  Chicken Bowl       21.96
44            Chicken Soft Tacos       21.96
45                  Chicken Bowl       21.96
46                  Chicken Bowl       21.96

## finally i fatched those record thats are less than 20 rupees

##  how many items are involve in the price rate

In [144]:
item_name_list=fatch_data_less_than_20['item_name'].value_counts()
item_name_list

Chicken Bowl                    12
Chicken Salad Bowl              10
Steak Burrito                    6
Chicken Burrito                  6
Steak Bowl                       5
Carnitas Bowl                    2
Steak Salad Bowl                 2
Chips and Fresh Tomato Salsa     1
Bowl                             1
Veggie Burrito                   1
Chicken Soft Tacos               1
Name: item_name, dtype: int64

### here list those item are less than 20

In [174]:
item_list=item_name_list.index
item_list=pd.Series(item_list,name='itme_list')
item_list.name           #for chek the name
item_list=item_list.values
#this is item list which are less than 20 rupees
print(item_list,end="")

['Chicken Bowl' 'Chicken Salad Bowl' 'Steak Burrito' 'Chicken Burrito'
 'Steak Bowl' 'Carnitas Bowl' 'Steak Salad Bowl'
 'Chips and Fresh Tomato Salsa' 'Bowl' 'Veggie Burrito'
 'Chicken Soft Tacos']

In [115]:
less_than_20_priceDF=orders[orders['item_price'] <20].sort_values(by='item_price',ascending=False)
list_less_than_20_rps=less_than_20_priceDF[['item_price','item_name']]
list_less_than_20_rps.reset_index(drop=True).value_counts(list_less_than_20_rps.item_name).shape

(50,)

In [101]:
orders['item_price'].min()

1.09